learning/app/Http/Controllers/CourseController.php

	public function show (Course $course) {
		$course->load([
			'category' => function ($q) {
				$q->select('id', 'name');
			},
			'goals' => function ($q) {
				$q->select('id', 'course_id', 'goal');
			},
			'level' => function ($q) {
				$q->select('id', 'name');
			},
			'requirements' => function ($q) {
				$q->select('id', 'course_id', 'requirement');
			},
			'reviews.user',
			'teacher'
		])->get();
---
select * from `teachers` where `teachers`.`id` in (3)
select * from `users` where `users`.`id` in (1)
select `id`, `course_id`, `goal` from `goals` where `goals`.`course_id` in (32)
select `id`, `course_id`, `requirement` from `requirements` where `requirements`.`course_id` in (32)